davidBalderramaS/ESC_BLDC_STM32G431/ESC_STM32G431RB/Core/main.c
/*
 * ESC - Single Motor Driver
 * Using the stm32G431 microcontroller, back emf detection
 *
 * Author: David Balderrama S.
 * Start Date: 7/27/2025
 *
 */

#include "stm32g4xx.h"
#include "stm32g431xx.h"
#include <stdio.h>
#include <math.h>

#include "Back_EMF/COMPx.h"
#include "Sensor_Handling/ADC.h"
#include "Communication/USART_printf.h"
#include "ESC_Control/PWM_To_Drivers.h"
#include "ESC_Control/OpenLoop_Config.h"
#include "ESC_Control/COMP_Loop_Config.h"
#include "Utils/Delay_Timer.h"
#include "Utils/Utils.h"

/*
 *       BRANCH
 */

int main(void){
	LED_PA10_Init();
	USART2_PA2_Init();        // PA2 == COMP2_INM
	ADC_Poten_PA7_Init();     // <- TIMER3
	Delay_TIM17_Init();       // Delay_mS()


	COMP1_Init();             // PA1+ | PA4-  -> P1
	COMP3_Init_v2();          // PC1+ | PC0-  -> P2
	COMP4_Init_v2();          // PB0+ | PB2-  -> P3


	PWM_PB6_TIM4_CH1_Init();  // M1H
	PWM_PB3_TIM2_CH2_Init();  // M1L
	PWM_PA15_TIM2_CH1_Init(); // M2H
	PWM_PB7_TIM4_CH2_Init();  // M2L
	PWM_PC2_TIM1_CH3_Init();  // M3H
	PWM_PC3_TIM1_CH4_Init();  // M3L


	// Ensure global interrupts are enabled
	if (__get_PRIMASK() & 1){
		__enable_irq();
	}


	while (1){
		if (toggle_State == 0){
			// No feedback. Manually triggers commutational steps
			Open_Loop();
		}
		else if (toggle_State == 1){
			// Uses feedback from back EMF to trigger commutational steps
	        Closed_Loop();
		}
	}
}


/*
 *  Somewhere along the lines, my COMPx stopped working.
 *  They no longer are tracking or measuring
 *
 *  Essentially, they are always tracking the value of bit "COMP_CSR_VALUE" to be 0
 *  even though I'm applying a controlled voltage so that COMP_INP > COMP_INM
 *                                                            3V   >   1V
 *
 */


/*
 *
	        if (COMP1->CSR & COMP_CSR_VALUE){
	            GPIOA->ODR |= LED_PA10;
	            printf("HIGH \r\n");
	        }
	        else {
	            GPIOA->ODR &= ~LED_PA10;
	            printf("LOW \r\n");
	        }
 *
 */


